witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX2_AUDIO_I =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};
arm_biquad_cascade_df2T_instance_f32 DECIMATE_IIR_RX2_AUDIO_Q =
	{
		.numStages = IIR_DECIMATOR_FILTER_STAGES,
		.pState = (float32_t[IIR_DECIMATOR_FILTER_STAGES * 2]){0},
		.pCoeffs = DECIMATE_IIR_Coeffs,
};

//Public variables
const uint32_t AUTIO_FILTERS_HPF_LIST[CW_HPF_COUNT] = {0, 60, 100, 200, 300, 400, 500, 600};
const uint32_t AUTIO_FILTERS_LPF_CW_LIST[CW_LPF_COUNT] = {100, 150, 200, 250, 300, 350, 400, 450, 500, 550, 600, 650, 700, 750, 800, 850, 900, 950, 1000};
const uint32_t AUTIO_FILTERS_LPF_SSB_LIST[SSB_LPF_COUNT] = {1400, 1600, 1800, 2100, 2300, 2500, 2700, 2900, 3000, 3200, 3400};
const uint32_t AUTIO_FILTERS_LPF_AM_LIST[AM_LPF_COUNT] = {2100, 2300, 2500, 2700, 2900, 3000, 3200, 3400, 3600, 3800, 4000, 4500, 5000, 6000, 7000, 8000, 9000, 10000};
const uint32_t AUTIO_FILTERS_LPF_NFM_LIST[NFM_LPF_COUNT] = {5000, 6000, 7000, 8000, 9000, 10000, 15000, 20000};

arm_fir_instance_f32 FIR_RX1_Hilbert_I; // filter instances
arm_fir_instance_f32 FIR_RX1_Hilbert_Q;
arm_fir_instance_f32 FIR_RX2_Hilbert_I;
arm_fir_instance_f32 FIR_RX2_Hilbert_Q;
arm_fir_instance_f32 FIR_TX_Hilbert_I;
arm_fir_instance_f32 FIR_TX_Hilbert_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_LPF_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_GAUSS;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_LPF_Q;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_GAUSS;
arm_biquad_cascade_df2T_instance_f32 IIR_TX_LPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_TX_HPF_I;
arm_biquad_cascade_df2T_instance_f32 IIR_RX1_Squelch_HPF;
arm_biquad_cascade_df2T_instance_f32 IIR_RX2_Squelch_HPF;
arm_biquad_cascade_df2T_instance_f32 NOTCH_RX1_FILTER = {NOTCH_STAGES, NOTCH_RX1_State, NOTCH_RX1_Coeffs}; // manual notch filter
arm_biquad_cascade_df2T_instance_f32 NOTCH_RX2_FILTER = {NOTCH_STAGES, NOTCH_RX2_State, NOTCH_RX2_Coeffs};
arm_biquad_cascade_df2T_instance_f32 NOTCH_FFT_I_FILTER = {NOTCH_STAGES, NOTCH_FFT_I_State, NOTCH_RX1_Coeffs};
arm_biquad_cascade_df2T_instance_f32 NOTCH_FFT_Q_FILTER = {NOTCH_STAGES, NOTCH_FFT_Q_State, NOTCH_RX1_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_LOW_FILTER = {EQ_STAGES, EQ_RX_LOW_FILTER_State, EQ_RX_LOW_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_MID_FILTER = {EQ_STAGES, EQ_RX_MID_FILTER_State, EQ_RX_MID_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_RX_HIG_FILTER = {EQ_STAGES, EQ_RX_HIG_FILTER_State, EQ_RX_HIG_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_LOW_FILTER = {EQ_STAGES, EQ_MIC_LOW_FILTER_State, EQ_MIC_LOW_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_MID_FILTER = {EQ_STAGES, EQ_MIC_MID_FILTER_State, EQ_MIC_MID_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 EQ_MIC_HIG_FILTER = {EQ_STAGES, EQ_MIC_HIG_FILTER_State, EQ_MIC_HIG_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX1_KW_HSHELF_FILTER = {EQ_STAGES, AGC_RX1_KW_HSHELF_FILTER_State, AGC_RX_KW_HSHELF_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX1_KW_HPASS_FILTER = {EQ_STAGES, AGC_RX1_KW_HPASS_FILTER_State, AGC_RX_KW_HPASS_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX2_KW_HSHELF_FILTER = {EQ_STAGES, AGC_RX2_KW_HSHELF_FILTER_State, AGC_RX_KW_HSHELF_FILTER_Coeffs};
arm_biquad_cascade_df2T_instance_f32 AGC_RX2_KW_HPASS_FILTER = {EQ_STAGES, AGC_RX2_KW_HPASS_FILTER_State, AGC_RX_KW_HPASS_FILTER_Coeffs};
volatile bool NeedReinitNotch = false;			   // need to re-initialize the manual Notch filter
volatile bool NeedReinitAudioFilters = false;	   // need to re-initialize Audio filters
volatile bool NeedReinitAudioFiltersClean = false; //also clean state

// Prototypes
static void calcBiquad(BIQUAD_TYPE type, uint32_t Fc, uint32_t Fs, float32_t Q, float32_t peakGain, float32_t *outCoeffs);									  // automatic calculation of the Biquad filter for Notch
static void arm_biquad_cascade_df2T_initNoClean_f32(arm_biquad_cascade_df2T_instance_f32 *S, uint8_t numStages, const float32_t *pCoeffs, float32_t *pState); //init without state-clean version
static void fill_biquad_coeffs(iir_filter_t *filter, float32_t *coeffs, uint8_t sect_num);

// initialize audio filters
void InitAudioFilters(void)
{
	//TX Hilbert
	arm_fir_init_f32(&FIR_TX_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_Tx_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
	arm_fir_init_f32(&FIR_TX_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_Tx_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);

	//AGC K-Weight LKFS BS.1770
	calcBiquad(BIQUAD_highShelf, 1500, TRX_SAMPLERATE, 1.0f / sqrtf(2), 4.0f, AGC_RX_KW_HSHELF_FILTER_Coeffs);
	calcBiquad(BIQUAD_highpass, 38, TRX_SAMPLERATE, 0.5f, 0.0f, AGC_RX_KW_HPASS_FILTER_Coeffs);

	//Other
	InitNoiseReduction();
	InitNotchFilter();
	InitAutoNotchReduction();
	InitVAD();
	ReinitAudioFilters();
}

// reinitialize audio filters
void ReinitAudioFilters(void)
{
	//RX1 Hilbert
	if (CurrentVFO()->Mode == TRX_MODE_CW_L || CurrentVFO()->Mode == TRX_MODE_CW_U)
	{
		arm_fir_init_f32(&FIR_RX1_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX1_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}
	else
	{
		arm_fir_init_f32(&FIR_RX1_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX1_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX1_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}

	//RX2 Hilbert
	if (SecondaryVFO()->Mode == TRX_MODE_CW_L || SecondaryVFO()->Mode == TRX_MODE_CW_U)
	{
		arm_fir_init_f32(&FIR_RX2_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX2_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}
	else
	{
		arm_fir_init_f32(&FIR_RX2_Hilbert_I, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_I_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_I[0], AUDIO_BUFFER_HALF_SIZE);
		arm_fir_init_f32(&FIR_RX2_Hilbert_Q, IQ_HILBERT_TAPS, (float32_t *)&FIR_HILB_Q_coeffs, (float32_t *)&Fir_RX2_Hilbert_State_Q[0], AUDIO_BUFFER_HALF_SIZE);
	}

	//parameters
	uint32_t hpf_rx1_width = 300; //default settings
	if (CurrentVFO()->HPF_Filter_Width > 0)
		hpf_rx1_width = CurrentVFO()->HPF_Filter_Width;
	//
	uint32_t hpf_rx2_width = 300; //default settings
	if (SecondaryVFO()->HPF_Filter_Width > 0)
		hpf_rx2_width = SecondaryVFO()->HPF_Filter_Width;
	//
	uint32_t lpf_rx1_width = 2700; //default settings
	if (CurrentVFO()->LPF_RX_Filter_Width > 0)
		lpf_rx1_width = CurrentVFO()->LPF_RX_Filter_Width;
	if(lpf_rx1_width < hpf_rx1_width)
		lpf_rx1_width = hpf_rx1_width + 100;
	//
	uint32_t lpf_rx2_width = 2700; //default settings
	if (SecondaryVFO()->LPF_RX_Filter_Width > 0)
		lpf_rx2_width = SecondaryVFO()->LPF_RX_Filter_Width;
	if(lpf_rx2_width < hpf_rx2_width)
		lpf_rx2_width = hpf_rx2_width + 100;
	//
	uint32_t lpf_tx_width = 2700; //default settings
	if (CurrentVFO()->LPF_TX_Filter_Width > 0)
		lpf_tx_width = CurrentVFO()->LPF_TX_Filter_Width;
	if(lpf_tx_width < hpf_rx1_width)
		lpf_tx_width = hpf_rx1_width + 100;
	//
	
	//Decimator filters
	uint32_t decim_iir_filter_stages = IIR_DECIMATOR_FILTER_STAGES;
	if(TRX_GetRXSampleRate > 192000)
		decim_iir_filter_stages = 5;
	iir_filter_t *filter = biquad_create(decim_iir_filter_stages);
	biquad_init_lowpass(filter, TRX_GetRXSampleRate, 20000);
	fill_biquad_coeffs(filter, DECIMATE_IIR_Coeffs, decim_iir_filter_stages);
	uint32_t need_decimate_rate = TRX_GetRXSampleRate / TRX_SAMPLERATE;
	DECIMATE_FIR_RX1_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX1_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_I.M = need_decimate_rate;
	DECIMATE_FIR_RX2_AUDIO_Q.M = need_decimate_rate;
	DECIMATE_IIR_RX1_AUDIO_I.numStages = decim_iir_filter_stages;
	
	//LPF RX1
	filter = biquad_create(IIR_LPF_STAGES);
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_I, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_LPF_Q, IIR_LPF_STAGES, IIR_RX1_LPF_Coeffs, (float32_t *)&IIR_RX1_LPF_Q_State[0]);
	
	//LPF TX
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_tx_width);
	fill_biquad_coeffs(filter, IIR_TX_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_LPF_I, IIR_LPF_STAGES, IIR_TX_LPF_Coeffs, (float32_t *)&IIR_TX_LPF_I_State[0]);
	
	//LPF RX2
	biquad_init_lowpass(filter, TRX_SAMPLERATE, lpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_LPF_Coeffs, IIR_LPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_I, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_LPF_Q, IIR_LPF_STAGES, IIR_RX2_LPF_Coeffs, (float32_t *)&IIR_RX2_LPF_Q_State[0]);

	//HPF
	filter = biquad_create(IIR_HPF_STAGES);
	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx1_width);
	fill_biquad_coeffs(filter, IIR_RX1_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_HPF_I, IIR_HPF_STAGES, IIR_RX1_HPF_Coeffs, (float32_t *)&IIR_RX1_HPF_I_State[0]);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_TX_HPF_I, IIR_HPF_STAGES, IIR_RX1_HPF_Coeffs, (float32_t *)&IIR_TX_HPF_I_State[0]);

	biquad_init_highpass(filter, TRX_SAMPLERATE, hpf_rx2_width);
	fill_biquad_coeffs(filter, IIR_RX2_HPF_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_HPF_I, IIR_HPF_STAGES, IIR_RX2_HPF_Coeffs, (float32_t *)&IIR_RX2_HPF_I_State[0]);

