witalis3/UA3REO-DDC-Transceiver/STM32/Src/audio_filters.c
	//FM Squelch
	if (CurrentVFO()->LPF_RX_Filter_Width > 15000 || CurrentVFO()->LPF_RX_Filter_Width == 0)
		biquad_init_highpass(filter, TRX_SAMPLERATE, 20000);
	else
		biquad_init_highpass(filter, TRX_SAMPLERATE, 15000);
	fill_biquad_coeffs(filter, IIR_RX1_HPF_SQL_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_Squelch_HPF, IIR_HPF_STAGES, IIR_RX2_HPF_SQL_Coeffs, (float32_t *)&IIR_RX1_HPF_SQL_State[0]);
	
	if (SecondaryVFO()->LPF_RX_Filter_Width > 15000 || SecondaryVFO()->LPF_RX_Filter_Width == 0)
		biquad_init_highpass(filter, TRX_SAMPLERATE, 20000);
	else
		biquad_init_highpass(filter, TRX_SAMPLERATE, 15000);
	fill_biquad_coeffs(filter, IIR_RX2_HPF_SQL_Coeffs, IIR_HPF_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_Squelch_HPF, IIR_HPF_STAGES, IIR_RX2_HPF_SQL_Coeffs, (float32_t *)&IIR_RX2_HPF_SQL_State[0]);

	//RX1 GAUSS
	filter = biquad_create(GAUSS_STAGES);
	biquad_init_bandpass(filter, TRX_SAMPLERATE, lpf_rx1_width / 2 - GAUSS_WIDTH / 2, lpf_rx1_width / 2 + GAUSS_WIDTH / 2);
	fill_biquad_coeffs(filter, IIR_RX1_GAUSS_Coeffs, GAUSS_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX1_GAUSS, GAUSS_STAGES, IIR_RX1_GAUSS_Coeffs, (float32_t *)&IIR_RX1_GAUSS_State[0]);
	
	//RX2 GAUSS
	biquad_init_bandpass(filter, TRX_SAMPLERATE, lpf_rx2_width / 2 - GAUSS_WIDTH / 2, lpf_rx2_width / 2 + GAUSS_WIDTH / 2);
	fill_biquad_coeffs(filter, IIR_RX2_GAUSS_Coeffs, GAUSS_STAGES);
	arm_biquad_cascade_df2T_initNoClean_f32(&IIR_RX2_GAUSS, GAUSS_STAGES, IIR_RX2_GAUSS_Coeffs, (float32_t *)&IIR_RX2_GAUSS_State[0]);
	
	//RX Equalizer
	calcBiquad(BIQUAD_peak, 400, TRX_SAMPLERATE, 0.5f, TRX.RX_EQ_LOW, EQ_RX_LOW_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 1000, TRX_SAMPLERATE, 1.0f, TRX.RX_EQ_MID, EQ_RX_MID_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 2000, TRX_SAMPLERATE, 1.5f, TRX.RX_EQ_HIG, EQ_RX_HIG_FILTER_Coeffs);

	//MIC Equalizer
	calcBiquad(BIQUAD_peak, 400, TRX_SAMPLERATE, 0.5f, TRX.MIC_EQ_LOW, EQ_MIC_LOW_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 1000, TRX_SAMPLERATE, 1.0f, TRX.MIC_EQ_MID, EQ_MIC_MID_FILTER_Coeffs);
	calcBiquad(BIQUAD_peak, 2000, TRX_SAMPLERATE, 1.5f, TRX.MIC_EQ_HIG, EQ_MIC_HIG_FILTER_Coeffs);

	//All done
	NeedReinitAudioFilters = false;
	NeedReinitAudioFiltersClean = false;
}

// initialize the manual Notch filter
void InitNotchFilter(void)
{
	calcBiquad(BIQUAD_notch, CurrentVFO()->NotchFC / 2, TRX_SAMPLERATE, 0.5f, 0, NOTCH_RX1_Coeffs);
	calcBiquad(BIQUAD_notch, SecondaryVFO()->NotchFC / 2, TRX_SAMPLERATE, 0.5f, 0, NOTCH_RX2_Coeffs);
	NeedReinitNotch = false;
}

// start DC corrector
void dc_filter(float32_t *Buffer, int16_t blockSize, DC_FILTER_STATE stateNum) // removes the DC component of the signal
{
	static const float32_t A1 = (1.0f - 0.00048828125f); // (1-2^(-11))

	for (uint16_t i = 0; i < blockSize; i++)
	{
		float32_t sampleIn = Buffer[i];
		float32_t sampleOut = 0;
		float32_t delta_x = sampleIn - DC_Filter_State[stateNum].x_prev;
		float32_t a1_y_prev = A1 * DC_Filter_State[stateNum].y_prev;
		sampleOut = delta_x + a1_y_prev;
		DC_Filter_State[stateNum].x_prev = sampleIn;
		DC_Filter_State[stateNum].y_prev = sampleOut;
		Buffer[i] = sampleOut;
	}
}

// automatic calculation of the Biquad filter
static void calcBiquad(BIQUAD_TYPE type, uint32_t Fc, uint32_t Fs, float32_t Q, float32_t peakGain, float32_t *outCoeffs)
{
	float32_t a0, a1, a2, b1, b2, norm;

	float32_t V = powf(10.0f, fabsf(peakGain) / 20.0f);
	float32_t K = tanf(PI * Fc / Fs);
	switch (type)
	{
	case BIQUAD_onepolelp:
		b1 = expf(-2.0f * PI * (Fc / Fs));
		a0 = 1.0f - b1;
		b1 = -b1;
		a1 = a2 = b2 = 0.0f;
		break;

	case BIQUAD_onepolehp:
		b1 = -expf(-2.0f * PI * (0.5f - Fc / Fs));
		a0 = 1.0f + b1;
		b1 = -b1;
		a1 = a2 = b2 = 0.0f;
		break;

	case BIQUAD_lowpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = K * K * norm;
		a1 = 2.0f * a0;
		a2 = a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_highpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = 1.0f * norm;
		a1 = -2.0f * a0;
		a2 = a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_bandpass:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = K / Q * norm;
		a1 = 0.0f;
		a2 = -a0;
		b1 = 2.0f * (K * K - 1.0f) * norm;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_notch:
		norm = 1.0f / (1.0f + K / Q + K * K);
		a0 = (1.0f + K * K) * norm;
		a1 = 2.0f * (K * K - 1.0f) * norm;
		a2 = a0;
		b1 = a1;
		b2 = (1.0f - K / Q + K * K) * norm;
		break;

	case BIQUAD_peak:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + 1.0f / Q * K + K * K);
			a0 = (1.0f + V / Q * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - V / Q * K + K * K) * norm;
			b1 = a1;
			b2 = (1.0f - 1.0f / Q * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (1.0f + V / Q * K + K * K);
			a0 = (1.0f + 1.0f / Q * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - 1.0f / Q * K + K * K) * norm;
			b1 = a1;
			b2 = (1.0f - V / Q * K + K * K) * norm;
		}
		break;
	case BIQUAD_lowShelf:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + SQRT2 * K + K * K);
			a0 = (1.0f + sqrtf(2.0f * V) * K + V * K * K) * norm;
			a1 = 2.0f * (V * K * K - 1.0f) * norm;
			a2 = (1.0f - sqrtf(2.0f * V) * K + V * K * K) * norm;
			b1 = 2.0f * (K * K - 1.0f) * norm;
			b2 = (1.0f - SQRT2 * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (1.0f + sqrtf(2.0f * V) * K + V * K * K);
			a0 = (1.0f + SQRT2 * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - SQRT2 * K + K * K) * norm;
			b1 = 2.0f * (V * K * K - 1.0f) * norm;
			b2 = (1.0f - sqrtf(2.0f * V) * K + V * K * K) * norm;
		}
		break;
	case BIQUAD_highShelf:
		if (peakGain >= 0.0f)
		{
			norm = 1.0f / (1.0f + SQRT2 * K + K * K);
			a0 = (V + sqrtf(2.0f * V) * K + K * K) * norm;
			a1 = 2.0f * (K * K - V) * norm;
			a2 = (V - sqrtf(2.0f * V) * K + K * K) * norm;
			b1 = 2.0f * (K * K - 1.0f) * norm;
			b2 = (1.0f - SQRT2 * K + K * K) * norm;
		}
		else
		{
			norm = 1.0f / (V + sqrtf(2.0f * V) * K + K * K);
			a0 = (1.0f + SQRT2 * K + K * K) * norm;
			a1 = 2.0f * (K * K - 1.0f) * norm;
			a2 = (1.0f - SQRT2 * K + K * K) * norm;
			b1 = 2.0f * (K * K - V) * norm;
			b2 = (V - sqrtf(2.0f * V) * K + K * K) * norm;
		}
		break;
	}

	//save coefficients
	outCoeffs[0] = a0;
	outCoeffs[1] = a1;
	outCoeffs[2] = a2;
	outCoeffs[3] = -b1;
	outCoeffs[4] = -b2;
}

static void arm_biquad_cascade_df2T_initNoClean_f32(arm_biquad_cascade_df2T_instance_f32 *S, uint8_t numStages, const float32_t *pCoeffs, float32_t *pState)
{
	if (NeedReinitAudioFiltersClean) //original func
	{
		arm_biquad_cascade_df2T_init_f32(S, numStages, pCoeffs, pState);
		return;
	}

	/* Assign filter stages */
	S->numStages = numStages;

	/* Assign coefficient pointer */
	S->pCoeffs = pCoeffs;

	/* Assign state pointer */
	S->pState = pState;
}

static void fill_biquad_coeffs(iir_filter_t *filter, float32_t *coeffs, uint8_t sect_num)
{
	//transpose and save coefficients
	uint16_t ind = 0;
	for(uint8_t sect = 0; sect < sect_num; sect++)
	{
		coeffs[ind + 0] = filter->b[sect * 3 + 0];
		coeffs[ind + 1] = filter->b[sect * 3 + 1];
		coeffs[ind + 2] = filter->b[sect * 3 + 2];
		coeffs[ind + 3] = -filter->a[sect * 3 + 1];
		coeffs[ind + 4] = -filter->a[sect * 3 + 2];
		ind += 5;
	}
}
